In [1]:
import pandas as pd
import numpy as np

In [23]:
df_abs_error = pd.DataFrame({"pred pKa": [-1.83, -1.07, -2.30, -2.30],
                            "3.89": [5.72, 4.96, 6.19, 6.19],
                            "exp pKa2": [6.72, 5.96, 7.19, 5.19]})
df_abs_error = df_abs_error.set_index("pred pKa")
df_abs_error

          3.89  exp pKa2
pred pKa
-1.83     5.72      6.72
-1.07     4.96      5.96
-2.30     6.19      7.19
-2.30     6.19      5.19

In [27]:
df_abs_error["pred pKa"] = df_abs_error.index
df_abs_error = df_abs_error.reset_index(drop=True)
df_abs_error

   3.89  exp pKa2  pred pKa
0  5.72      6.72     -1.83
1  4.96      5.96     -1.07
2  6.19      7.19     -2.30
3  6.19      5.19     -2.30

In [16]:
df_abs_error.reindex()

   3.89  exp pKa2  pred pKa
0  5.72      6.72     -1.83
1  4.96      5.96     -1.07
2  6.19      7.19     -2.30
3  6.19      5.19     -2.30

In [17]:
for i, row in enumerate(df_abs_error.iterrows()):
    pred_pKa = row[1]["pred pKa"]
    min_abs_error = min(df_abs_error.loc[i, df_abs_error.columns != "pred pKa"])
    matched_exp_pKa =  df_abs_error.loc[:, df_abs_error.loc[i, :].values == min_abs_error].columns.values[0]
    
    print("min abs error", min_abs_error)
    print("matched exp pKa",  matched_exp_pKa )
    #matched_exp_pKa = df_abs_error.loc[:, df_abs_error.loc[pred_pKa, :].values == min_abs_error].columns.values[0]

min abs error 5.72
matched exp pKa 3.89
min abs error 4.96
matched exp pKa 3.89
min abs error 6.19
matched exp pKa 3.89
min abs error 5.19
matched exp pKa exp pKa2

In [28]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

In [31]:
df = df.drop(["Yuma", "Maricopa"])

             name  reports  year
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013

In [39]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df.index.name = "Name"
df

             name  reports  year
Name
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013
Maricopa     Jake        2  2014
Yuma          Amy        3  2014

In [40]:
df = df.drop(["Yuma", "Maricopa"])
df

             name  reports  year
Name
Cochice     Jason        4  2012
Pima        Molly       24  2012
Santa Cruz   Tina       31  2013

In [41]:
df = df.drop(["Yuma", "Maricopa"])

ValueError: labels ['Yuma' 'Maricopa'] not contained in axis